Repository: FragBis/FragTale2
Catalog: resources/locales/*/LC_MESSAGES/core.po
Languages: fr_fr

source: Select one of the controller(s) listed bellow:
fr_fr: Choisissez l'un des contrôleurs dans la liste ci-dessous :

source: Type number:
fr_fr: Tapez l'un des numéros :

source: Running controller %s
fr_fr: Exécution du contrôleur %s

source: ./fragtale2 <Path/To/Controller> [args...]
fr_fr: ./fragtale2 <Chemin/Vers/Controleur> [args...]

source: It is strongly recommended to create a controller by this command:
fr_fr: Il est fortement recommandé de créer un contrôleur avec cette commande :

source: You can also inspect controllers in "Console" folder by pressing [TAB] twice:
fr_fr: Vous pouvez également inspecter les contrôleurs placés dans le répertoire "Console" en appuyant sur la touche [TAB] deux fois rapidement :

source: "fragtale" command can also execute controllers placed into "Project" folder: (example)
fr_fr: La commande "fragtale" peut aussi exécuter un contrôleur placé dans le répertoire "Project" (exemple) :

source: Obviously, you created the project before:
fr_fr: Bien sûr, vous avez créé le projet avant :

source: And at the very beginning, after install, you launched:
fr_fr: Et au tout début, juste après l'installation, vous avez lancé :

source: #ROUTE_ERROR: Missing explicit controller argument in non-interactive Shell
fr_fr: #ERREUR_ROUTE : Passer l'argument "--controller" de manière explicite est requis lorsque le Shell est lancé en mode "non interactif" (pas de dialogue)

source: You need to be root or sudoer.
fr_fr: Vous devez être "root" ou "sudoer".

source: CLI arguments:
fr_fr: Arguments CLI :

source: · "--host": server name
fr_fr: · "--host" : Le nom du serveur ou nom d'hôte

source: · "--project": project name to bind with host
fr_fr: · "--project" : Le nom du projet à associer au nom d'hôte

source: · "--force": [0|1] If true, it will run all configuration processes with minimum prompts.
fr_fr: · "--force" : [0|1] Si vrai (1), cela lancera tous les processus de configuration avec le minimum de prompts.

source: Installation process supports Debian-like distributions.
fr_fr: Ce processus d'installation supporte principalement les distributions GNU Linux dérivées de Debian.

source: It will help you to setup a development environment using a virtual host.
fr_fr: C'est une assistance pour suivre les fonctionnalités de création d'un environnement de développement avec virtual host.

source: It comes with no warranty. It uses the most common setup deployed on a Debian server.
fr_fr: Votre machine est peut-être configurée avec des méthodes spécifiques, de ce fait, la copie du fichier de configuration du serveur Web pourrait ne pas suffire.

source: You are using PHP version %s
fr_fr: Vous utilisez actuellement la version PHP %s

source: Type hostname you want to setup:
fr_fr: Tapez le nom d'hôte que vous souhaitez déployer :

source: Hostname to setup: %s
fr_fr: Nom d'hôte (hostname) à configurer : %s

source: Do you want to append this hostname to your "/etc/hosts" file? [yN]
fr_fr: Voulez-vous ajouter ce nom d'hôte à votre fichier "/etc/hosts" ? [oui, NON]

source: n {means no}
fr_fr: non

source: Could not find "/etc/hosts" file!
fr_fr: Fichier "/etc/hosts" introuvable ou inaccessible !

source: Do you want to add a basic configuration file to your Apache or Nginx server? [yN]
fr_fr: Voulez-vous ajouter un fichier de configuration "sites-available" à votre serveur Apache ou Nginx ? [oui, NON]

source: Select your web server:
fr_fr: Choisissez votre serveur Web :

source: Project "%s" does not exist or does not match required structure to run a website!
fr_fr: Le projet "%s" n'existe pas ou ne possède pas la structure nécessaire pour faire fonctionner un site Web !

source: You have to bind your new host to an existing project. Do you want to create a new project? [yN]
fr_fr: Vous devez associer votre nouveau nom d'hôte à un projet existant. Voulez-vous en créer un nouveau ? [oui, NON]

source: You should "chown" your project folder to be the owner if you want to modify files.
fr_fr: Vous devriez exécuter la commande "chown" (récursivement) à votre répertoire projet afin d'en être le propriétaire et de pouvoir y modifier les fichiers (en principe, le projet appartient actuellement à "root").

source: You can let "root" to be owner of the FragTale2 framework.
fr_fr: Vous pouvez laisser "root" être le propriétaire de tous les fichiers du framework FragTale2.

source: You can use GIT and version your project folder.
fr_fr: Vous pouvez utiliser GIT et versionner vos répertoires de projet (Project/{MonProjet}).

source: Do not include FragTale2 framework in your version control.
fr_fr: N'incluez pas le framework FragTale2 dans vos propres projets GIT.

source: You can now exit "root" or "sudo" mode.
fr_fr: Vous pouvez sortir du mode "root" ou "sudoer".

source: You'll have to bind your host to one of your project environment, but default is "production".
fr_fr: Vous devez associer votre hôte à l'un de vos environnements de projet, mais par défaut c'est "production".

source: Execute following command:
fr_fr: Exécutez la commande suivante :

source: Entering project management space
fr_fr: Espace configuration projet

source: You have 4 sections:
fr_fr: 4 sections au choix :

source: · "Configure": offers 3 actions to configure your project databases, environments and custom parameters
fr_fr: · "Configure" : propose 3 actions pour configurer les bases de données, les environnements et les paramètres utilisateurs du projet

source: · "Controller": you can create a new controller
fr_fr: · "Controller" : vous pouvez créer une nouveau contrôleur

source: · "Create": allows you to create a new project from scratch
fr_fr: · "Create" : permet de créer un nouveau projet "from scratch"

source: · "Model": map your database tables and relations (ORM)
fr_fr: · "Model": mappez les tables et les relations d'une base de données (ORM)

source: File "%s" successfully updated
fr_fr: Le fichier "%s" a été mis à jour avec succès

source: Unknown project "%s"
fr_fr: Projet "%s" inconnu

source: Select project
fr_fr: Sélectionnez l'un des projets suivants

source: Directory "%s" does not exist yet. You should execute first command: ./fragtale Console/Setup
fr_fr: Le répertoire "%s" n'existe pas encore. Vous devriez d'abord exécuter la commande : ./fragtale Console/Setup

source: You have not created a project yet. Going through project creation:
fr_fr: Vous n'avez pas encore créé de projet.

source: CLI option:
fr_fr: Option CLI :

source: · "--project": The project name (if not passed, application will prompt you to select an existing project)
fr_fr: · "--project" : (optionnel) Le nom du projet en casse sensible (si l'argument n'est pas spécifié, l'application vous demandera de choisir parmi la liste des projets existant)

source: Setting up project "%s"
fr_fr: Configuration du projet "%s"

source: You have 3 actions:
fr_fr: Choisissez parmi ces 3 actions :

source: · "Database": setup your database credentials (SQL & MongoDB)
fr_fr: · "Database" : entrez vos paramètres de connexion à différents types de serveur de base de données (SQL & MongoDB)

source: · "Environment": setup your environments, basically corresponding to "production" and "development"
fr_fr: · "Environment" : de base, vous avez 2 environnements à configurer (i.e. "production" et "development")

source: · "Parameter": optionally edit some custom project parameters that you can use for your own purposes
fr_fr: · "Parameter" : optionnellement, éditez ou créez des paramètres spécifiques que vous pourrez utiliser dans votre code (il peut s'agir de n'importe quel type de paramètre). Ces paramètres peuvent être placés "globalement" pour un projet donné ou bien placés uniquement dans l'une des sections "environements" (ou réécrit en "surcharge" d'un paramètre global)

source: Continue configuring databases, environments or user paramaters? [Yn]
fr_fr: Poursuivre la configuration d'une base de données, d'un environnement ou des paramètres utilisateurs ? [OUI, non]

source: y {means yes}
fr_fr: oui

source: Entering project "%s" database configuration:
fr_fr: Configuration des bases utilisées par le projet "%s" :

source: You'll have to choose one configuration among the list of connector IDs
fr_fr: Vous aurez à choisir l'un des ID de connecteur de la liste

source: Then, enter credentials step-by-step
fr_fr: Puis, entrez les paramètres de connexion pas-à-pas

source: Could not find database configuration
fr_fr: Impossible de trouver ou récupérer la configuration pour les bases de données

source: Choose one available connection to modify (leave empty if you want to create new connection, Ctrl+C to quit): (total %d)
fr_fr: Choisissez l'une de ces connexions pour modification (laissez vide si vous voulez créer une nouvelle connexion, Ctrl+C pour quitter) : (total %d)

source: Updating configuration:
fr_fr: Mise à jour de la configuration :

source: You have not setup a database yet. Do you want to configure new database connection? Y, N
fr_fr: Vous n'avez pas encore configurer de connexion à une base de données. Voulez-vous configurer une nouvelle connexion ? [oui, non]

source: Creating new database configuration:
fr_fr: Création d'une nouvelle connexion à base de données :

source: Give a name to your database configuration:
fr_fr: Donnez un nom à cette configuration base de données :

source: Type one of the following database drivers:
fr_fr: Tapez l'un de ces pilotes (drivers) de base de données :

source: Type server name or IP address of database host:
fr_fr: Tapez le nom d'hôte ou l'IP du serveur de la base de données :

source: Type port number (leave blank to use default port or to keep previous entry):
fr_fr: Numéro du port (laissez vide pour utiliser le port par défaut ou garder la valeur inchangée) :

source: Type database name:
fr_fr: Nom de la base de données (database name) :

source: Type username:
fr_fr: Nom de l'utilisateur (username) :

source: Type password:
fr_fr: Mot de passe (password) :

source: Type charset (leave blank to use database default charset, most commonly "utf8"):
fr_fr: Charset (laissez vide pour utiliser le charset par défaut, la plupart du temps "utf8") :

source: This parameter is required and cannot be empty
fr_fr: Ce paramètre est requis et ne peut pas être vide

source: Unsupported driver:
fr_fr: Pilote non pris en charge :

source: A database connection named "%s" already exists. Please enter another name.
fr_fr: Une connexion à base de données nommée "%s" existe déjà. Veuillez entrer un autre nom.

source: Confirm save: [Yn]
fr_fr: Confirmez la sauvegarde : [OUI, non]

source: Replacing database settings named:
fr_fr: Mise à jour de la configuration base de données nommée :

source: Adding new database settings named:
fr_fr: Ajout d'un nouvelle configuration base de données nommée :

source: Delete a database connector from project "%s"
fr_fr: Supprimer l'un des connecteurs de base de données du projet "%s"

source: This will definitely remove this configuration from your file
fr_fr: Ceci supprimera définitivement ces paramètres de configuration du fichier de configuration

source: Select the configuration you want to delete (you cannot roll back, backup your configuration file if not sure):
fr_fr: Sélectionnez la conf à supprimer (vous ne pourrez pas revenir en arrière, sauvegardez votre fichier de configuration en cas de doute) :

source: Confirm removing "%s" from settings: [yN]
fr_fr: Confirmez la suppression de "%s" du fichier de conf : [oui, NON]

source: You have not selected a database configuration to delete.
fr_fr: Vous n'avez pas sélectionné une conf BDD à supprimer.

source: Delete another one? [yN]
fr_fr: En supprimer une autre ? [oui, NON]

source: Entering project "%s" environments setup
fr_fr: Configuration des environnements du projet "%s"

source: Edit or create environment: define which database connector to use as default, choose your locale and enable debug mode.
fr_fr: Modifiez ou créez un environnement : sélectionnez quel connecteur de base de données doit être utilisé par défaut, définissez votre locale et activez le mode débogue.

source: Bind a hostname to a project is not enough. You should also bind an environment to a hostname.
fr_fr: Lier un nom de domaine à un projet ne suffit pas, il vous faut également associer un environnement à ce nom d'hôte.

source: You have 2 action groups:
fr_fr: Choisissez parmi ces 2 groupes d'actions :

source: Choose another action group? [Yn]
fr_fr: Choisir un autre groupe d'actions ? [OUI, non]

source: Select which environment to update (leave empty to enter new one)
fr_fr: Sélectionnez l'environnement à mettre à jour (laissez vide pour ajouter une nouvelle entrée)

source: Enter new environment name
fr_fr: Saisissez le nom (ID) du nouvel environnement (par exemple : preprod, staging etc...)

source: Select one of these SQL credentials to set as default for environment "%s"
fr_fr: Sélectionnez l'une de ces confs SQL à définir comme conf par défaut pour l'environnement "%s"

source: Select one of these Mongo credentials to set as default for environment "%s"
fr_fr: Sélectionnez l'une de ces confs MongoDB à définir comme conf par défaut pour l'environnement "%s"

source: Activate debug mode? [yn]
fr_fr: Activer le mode débogage ? [oui, non]

source: Host "%s" contained in these environments is not bound to this project (as declared in "hosts.json" conf file).
fr_fr: L'hôte "%s" contenu dans la liste d'environnements n'est pas associée en amont à ce projet (voir fichier "resources/configuration/hosts.json").

source: Do you want to remove it? [Yn]
fr_fr: Voulez-vous supprimer cette entrée ? [OUI, non]

source: Choose between one of these hosts ("default" is the environment used by default)
fr_fr: Choisissez l'un de ces domaines ("default" est l'environnement utilisé par défaut)

source: Bind it to one of these environment
fr_fr: Associez-le avec l'un de ces environnements

source: Entering project "%s" parameters setup
fr_fr: Espace de gestion des paramètres du projet "%s"

source: Entering project "%s" maintenance parameter setup
fr_fr: Mise en maintenance de votre projet "%s"

source: Do you want to set maintenance parameter for all environments? [Yn]
fr_fr: Voulez-vous assigner le paramètre de maintenance pour TOUS les environnements de ce projet (tapez non pour choisir l'environnement spécifique) ? [OUI/non]

source: There is no environment set yet in your %s file.
fr_fr: Aucun environnement n'a encore été configuré dans votre fichier %s.

source: Choose the environment you want to set maintenance parameter:
fr_fr: Choisissez l'environnement pour lequel vous souhaitez effectuer ou retirer une maintenance (tapez l'un des numéros) :

source: Selected environment: %s
fr_fr: Environnement sélectionné : %s

source: Invalid environment selection
fr_fr: Sélection invalide

source: Unabled to initialize parameters.
fr_fr: Impossible d'initialiser les paramètres.

source: Type 1 to set maintenance ON, type 0 to set maintenance OFF (actual value: %s):
fr_fr: Tapez 1 pour activer la maintenance, tapez 0 pour désactiver la maintenance (actuellement : %s) :

source: You have chosen to set your website maintenance ON!
fr_fr: Vous avez choisi de mettre votre site en maintenance !

source: You have chosen to set your website maintenance OFF
fr_fr: Vous avez choisi de réexposer votre site, la maintenance est terminée

source: Invalid answer
fr_fr: Réponse invalide

source: **** Help invoked ****
fr_fr: **** Aide invoquée ****

source: There are %s CLI options handled (not required):
fr_fr: Il y a %s options CLI optionnelles :

source: · "--project": the project name
fr_fr: · "--project" : Le nom du projet

source: · "--dir": the controller folder in which to place it; It can be the relative path from the project directory or from controller type folder (e.g.: Project/{projectName}/Controller/{controllerType})
fr_fr: · "--dir" : Le répertoire dans lequel placer le contrôleur ; C'est le chemin relatif depuis le répertoire du type du contrôleur (i.e. Project/{projectName}/Controller/{controllerType}). Dans le doute, ne passez pas ce paramètre, l'application vous demandera explicitement dans quel répertoire placer le contrôleur.

source: · "--name": the new controller class name
fr_fr: · "--name" : Le nom de la classe du nouveau contrôleur

source: · "--type": controller type in list ['Web', 'Cli', 'Block']
fr_fr: · "--type" : Le type du contrôleur parmi : 'Web', 'Cli' et 'Block' (tapez l'un de ces 3 types)

source: · "--pattern": pattern folder name (placed in your project template patterns directory). Only for types "Web" and "Block"
fr_fr: · "--pattern": le nom du répertoire placé dans les "patrons" (patterns) de création de fichiers (contrôleur et vue). Seulement pour les types "Web" et "Block"

source: · "--swap-template": [0, 1] (or [true, false]); Indicate that you do not want to create the ".phtml" file associated with a Web Controller. This option is useless for Cli controller and Block controller always create the corresponding template.
fr_fr: · "--swap-template": [0, 1] (ou [true, false]); Indiquez que vous souhaitez ne pas créer le fichier ".phtml" associé à un Web Controller. Cette option est inutile pour les contrôleurs de type Cli (parce qu'il n'y a que des sorties en console) et Block (la template est créée obligatoirement).

source: About controller types:
fr_fr: À propos des types de contrôleurs :

source: · a "WEB" controller is exposed on the Web (but it can be executed in CLI or used as BLOCK).
fr_fr: · un contrôleur "WEB" est exposé sur le Web (mais il peut aussi être exécuté en mode CLI ou utilisé comme un BLOCK).

source: · a "BLOCK" controller is not directly exposed on the Web and included in another controller or view.
fr_fr: · un contrôleur "BLOCK" n'est pas directement exposé sur le Web et est inclus dans un autre contrôleur ou dans une vue.

source: · a "CLI" controller is only executed in console.
fr_fr: · un contrôleur "CLI" est exécuté uniquement en console.

source: Create a new controller
fr_fr: Créer un nouveau contrôleur

source: Add option "-h" for more information:
fr_fr: Ajoutez l'option "-h" pour plus d'infos :

source: Controller type "%s" not handled
fr_fr: Type de contrôleur "%s" non pris en charge

source: Which kind of controller do you wish to create?
fr_fr: Quel type de contrôleur souhaitez-vous créer ?

source: Creating controller type "%s"
fr_fr: Création d'un contrôleur "%s"

source: Please type the folder you want to place the %1s controller in: from "%2s" (you can press [TAB] to browse existing folders or leave blank to write in this folder)
fr_fr: Veuillez taper le répertoire dans lequel vous souhaitez placer le contrôleur "%1s" : depuis "%2s" (vous pouvez appuyer 2 fois sur la touche [TAB] pour explorer les répertoires ou laisser vide pour cibler ce répertoire de base)

source: "%s" does not match a valid namespace format. Remove any special chars, spaces or underscores... Class name must not be a PHP keyword.
fr_fr: "%s" ne correspond pas à un "nom d'espace" (namespace) valide. Éliminez les caractères spéciaux, les espaces ou les tirets... Le nom de la classe ne doit pas non plus correspondre à un mot réservé par PHP.

source: Using namespace "%s"
fr_fr: Utilisation de l'espace de nom "%s"

source: Type controller name (in camel case, no spaces, no underscore or any special characters, no .php file extension)
fr_fr: Tapez le nom du contrôleur (en "camel case", pas d'espaces, pas de tirets, pas de caractères spéciaux, sans l'extension de fichier ".php")

source: "%s" does not match a valid class name format. Remove any special chars, spaces or underscores... Class name must not be a PHP keyword.
fr_fr: "%s" ne correspond pas à un nom de classe valide. Éliminez les caractères spéciaux, les espaces ou les tirets... Le nom de la classe ne doit pas non plus correspondre à un mot réservé par PHP.

source: Creating controller "%s"
fr_fr: Création du contrôleur "%s"

source: Class "%s" already exists. You cannot replace existing classes via Console.
fr_fr: La classe "%s" existe déjà. Vous ne pouvez pas remplacer ou modifier une classe via la console.

source: Falling back to default controller pattern "%s"
fr_fr: Par défaut, sélection du patron de création pour contrôleurs "%s"

source: No ".phtml" file will be created.
fr_fr: Aucun fichier ".phtml" ne sera créé.

source: This controller will be accessible on the Web following URI: /%s
fr_fr: Ce contrôleur sera accessible via le Web depuis cet URI : /%s

source: Unhandled controller type "%s"
fr_fr: Type de contrôleur "%s" nom pris en charge

source: Template file "%s" created
fr_fr: Fichier de template créé "%s"

source: Unabled to copy file "%1s" to "%2s"
fr_fr: Impossible de copier "%1s" vers "%2s"

source: Controller name must not contain part of URI. Please enter the single class name.
fr_fr: Un nom de contrôleur ne peut pas contenir une partie d'une URI (il ne peut contenir de "/"). Merci de saisir un nom de classe sur un seul mot, sans séparateur.

source: Folder "%s" does not exist!
fr_fr: Le répertoire "%s" n'existe pas !

source: Select folder containing controller pattern:
fr_fr: Choisissez le répertoire contenant le patron du contrôleur :

source: · "--dir": the controller folder in which to place it; It can be the relative path from the project directory (e.g.: Project/{projectName}/Controller/Web)
fr_fr: · "--dir" : Répertoire dans lequel placer le contrôleur ; il s'agit du chemin relatif à partir du dossier du projet (i.e.: Project/{projectName}/Controller/Web)

source: · "--model": the model namespace
fr_fr: · "--model" : L'espace de nom du modèle (par ex. : "Project\{ProjectName}\Model\Sql\{ModelName}")

source: · "--entity": the entity name (without prefix)
fr_fr: · "--entity" : Le nom de l'entité (sans préfixe)

source: Creating new form for project "%s".
fr_fr: Création d'un nouveau formulaire pour le projet "%s".

source: Using model "%s"
fr_fr: Utilisation du modèle "%s"

source: Creating form for entity "%s"
fr_fr: Création du formulaire pour l'entité "%s"

source: In folder "%s"
fr_fr: Dans le répertoire "%s"

source: Using controller namespace "%s"
fr_fr: Utilisation de l'espace de nom "%s" pour ce contrôleur

source: Templates will be placed in "%s"
fr_fr: Les templates seront placées dans "%s"

source: Creating folders...
fr_fr: Création des répertoires...

source: Required class "%s" does not exist. Please check your model.
fr_fr: La classe "%s" est requise mais n'existe pas. Veuillez vérifier votre modèle.

source: Class "%s" must inherit from FragTale\Application\Model. Please check your model.
fr_fr: La classe "%s" doit obligatoirement hériter de "FragTale\Application\Model". Veuillez vérifier votre modèle.

source: Using pattern "%s"
fr_fr: Utilisation du pattern (patron de création de fichier) "%s"

source: You have not declared any models in your configuration file. You should generate a model first, by executing command: ./fragtale2 Console/Project/Model
fr_fr: Vous n'avez déclaré aucun modèle dans votre fichier de configuration. Vous devez d'abord générer un modèle en exécutant la commande : ./fragtale2 Console/Project/Model

source: Select a model namespace:
fr_fr: Choisissez un modèle dans la liste :

source: Please select an existing model.
fr_fr: Veuillez sélectionner un modèle existant.

source: Model namespace does not contain any valid entity.
fr_fr: L'espace de nom du modèle ne contient aucune entité valide.

source: Select one of the following entities:
fr_fr: Choisissez une entité dans la liste :

source: Using entity namespace "%1s" in folder "%2s"
fr_fr: Utilisation du nom d'espace d'entité "%1s" dans le répertoire "%2s"

source: Entity's folder "%s" does not exist
fr_fr: Le répertoire de l'entité "%s" n'existe pas

source: Entity "%1s" misses required class "%2s"
fr_fr: L'entité "%1s" dépend de la classe "%2s" qui n'existe pas
