Repository: FragBis/FragTale2
Catalog: resources/locales/*/LC_MESSAGES/core.po
Languages: fr_fr

source: Field "%1s" must contain maximum %2s signs.
fr_fr: Le champ "%1s" doit obligatoirement contenir un maximum de %2s caractère(s) ou chiffre(s).

source: Field "%s" must not be empty.
fr_fr: Le champ "%s" ne peut être vide.

source: Column "%s" has no type declared in table structure. You should remap your database.
fr_fr: La colonne "%s" n'a aucun type déclaré. Vous devriez "remapper" votre base de données dans le modèle correspondant.

source: Column "%1s" is a boolean. Value passed "%2s" is not valid (should be 0, 1, true or false).
fr_fr: La colonne "%1s" est un booléen. La valeur donnée "%2s" n'est pas valide (doit être 0, 1, true ou false).

source: Column "%1s" expected value to be an integer. Value passed: "%2s"
fr_fr: La colonne "%1s" n'accepte que les entiers numériques. Valeur donnée : "%2s"

source: Property "length" for column "%1s" must be an integer. Value set: %2s
fr_fr: La propriété "length" pour la colonne "%1s" doit obligatoirement être un entier numérique. Valeur donnée : %2s

source: Integer length limit for column "%1s" is %2s. Value passed: %3s (%4s)
fr_fr: La longueur (length) de l'entier pour la colonne "%1s" est limitée à %2s chiffre(s). Valeur donnée : %3s (%4s)

source: Column "%1s" expected a float. Value passed: %2s
fr_fr: La colonne "%1s" n'accepte que les valeurs de type "float" (décimale). Valeur donnée : %2s

source: Property "length" for column "%s" must be an array of 2 integers corresponding to decimal maximum length. You should remap your database.
fr_fr: La propriété "length" pour la colonne "%s" doit obligatoirement être un tableau de 2 entiers correspondant à la longueur maximale de ce nombre (par exemple : [5, 3] décrit un nombre de 5 chiffres dont 3 après la virgule. Vous devriez "remapper" votre base de données.

source: Column "%1s" expected decimal(%2s,%3s). Value passed: %4s will be truncated
fr_fr: La colonne "%1s" n'accepte que les valeurs decimal(%2s, %3s). La valeur donnée "%4s" sera tronquée.

source: Column "%1s" must contain maximum %2s signs. Value passed: "%3s" (%4s)
fr_fr: La colonne "%1s" doit obligatoirement contenir un maximum de %2s caractère(s). Valeur donnée : "%3s" (%4s)

source: Column "%1s" does not belong to table "%2s"
fr_fr: La colonne "%1s" n'appartient pas à la table "%2s"

source: Column "%s" is not defined as a foreign key
fr_fr: La colonne "%s" n'est pas définie comme clé étrangère

source: Defined primary key "%1s" from entity "%2s" is not listed in columns list
fr_fr: La clé primaire "%1s" de l'entité "%2s" ne fait pas partie de la liste des colonnes de cette table

source: You cannot auto register collection if there is no primary key declared for table "%s"
fr_fr: Vous ne pouvez pas enregistrer automatiquement une collection liée à une table de la base si cette table n'a pas de clé primaire (table concernée : "%s")

source: Unknown connector ID "%s"
fr_fr: Connecteur "%s" inconnu

source: Upsert cannot work if filters fetch more than 1 row. Process interrupted by ambiguous target data.
fr_fr: L'upsert ne peut pas fonctionner si les filtres de recherche de la ligne possiblement existante retournent plus d'une ligne. L'upsert n'a pu aboutir à cause de données cibles ambiguës.

source: Session ID moved from %1s to %2s
fr_fr: L'ID de session a été changé (de %1s à %2s)

source: You cannot recursively call "generateContent" function from inside its template
fr_fr: Vous ne pouvez pas invoquer la fonction "generateContent" récursivement depuis sa template

source: Trying to use inexisting template file: %s
fr_fr: Fichier template inexistant : %s

source: Unabled to save file %s
fr_fr: Échec de la sauvegarde du fichier "%s"

source: "%1s" file not found while importing %2s content into data collection.
fr_fr: Fichier "%1s" introuvable lors de l'importation du contenu %2s dans la collection.

source: You must set source to this MongoCollection to be able to query MongoDb server.
fr_fr: Pour pouvoir exécuter des requêtes MongoDB à partir d'une instance de MongoCollection, il est obligatoire de définir la source de la base. Utiliser la fonction "setSource".

source: You must set source to this MongoCollection to be able to upsert (save) data from MongoDb.
fr_fr: Pour pouvoir sauver ou mettre à jour des entrées dans MongoDB à partir d'une instance de MongoCollection, il est obligatoire de définir la source de la base. Utiliser la fonction "setSource".

source: %1s elements written (expected %2s) from collection %3s
fr_fr: "Upsert" : %1s élément(s) affecté(s) (%2s attendu(s)) dans la collection "%3s"

source: Something went wrong with Mongo Bulk Write. Diffs counted: %1s; Expected by bulk: %2s
fr_fr: Erreur lors de l'exécution de Mongo BulkWrite. %1s modification(s) trouvées dans la collection alors que l'objet "BulkWrite" attend %2s modification(s)

source: You must set source to this MongoCollection to be able to delete data from MongoDb.
fr_fr: Pour pouvoir supprimer des entrées dans MongoDB à partir d'une instance de MongoCollection, il est obligatoire de définir la source de la base. Utiliser la fonction "setSource".

source: You must set source to this MongoCollection to be able to upsert one data into MongoDb.
fr_fr: Vous devez définir et assigner la source de la "MongoCollection" afin d'insérer ou mettre à jour (upsert) un document MongoDB.

source: You must set source to this MongoCollection to be able to upsert many data into MongoDb.
fr_fr: Pour pouvoir sauver ou mettre à jour plusieurs entrées dans MongoDB à partir d'une instance de MongoCollection, il est obligatoire de définir la source de la base. Utiliser la fonction "setSource" pour définir cette source.

source: Each rows from parameter $documents must contain an "_id".
fr_fr: Chaque ligne du paramètre (tableau) $documents doit contenir obligatoirement la clé "_id" avec une valeur de type chaîne de caractère.

source: "%s" is not a valid XML file.
fr_fr: "%s" n'est pas un fichier XML valide.

source: Building delete query requires valid filters.
fr_fr: La construction d'une requête SQL pour suppression (QueryBuildDelete) nécessite le passage de filtres valides.

source: Affected row(s): %s
fr_fr: Nombre de lignes affectées : %s

source: No column and/or no value passed building insert query.
fr_fr: Aucune colonne ni valeur valides n'ont été passées pour la construction d'une requête "insert".

source: Rows affected: %s
fr_fr: Ligne(s) affectée(s) : %s

source: Parameter "$select" must be a single array containing string value or a full string.
fr_fr: Le paramètre "$select" doit être soit une chaîne, soit un tableau simple (clé/valeur) dont chaque valeur doit être une chaîne de caractères.

source: Row to update has no value passed that is updatable. Query builder cannot build the update query.
fr_fr: La ligne à mettre à jour (row) ne possède aucune valeur susceptible d'être modifiée. Le constructeur de requête (Query Builder) ne peut composer la requête SQL "update".

source: Data successfully updated.
fr_fr: Données modifiées avec succès.

source: Nothing changed.
fr_fr: Aucune modification effectuée.

source: Operator "%s" expects its value to be an array of other filters.
fr_fr: La valeur donnée pour l'opérateur "%s" doit être un tableau (array) contenant d'autres critères.

source: Operator "%s" expects its value to be litterally "NULL" or "NOT NULL" (and not else).
fr_fr: L'opérateur "%s" ne peut recevoir strictement que les valeurs "NULL" ou "NOT NULL".

source: Operator "%s" expects its value to be a string.
fr_fr: L'opérateur "%s" ne peut recevoir qu'une valeur de type chaîne.

source: Operator "%s" expects its value to be a boolean (e.g.: 0, 1, true, false).
fr_fr: L'opérateur "%s" ne peut recevoir qu'un booléen (valeur "vrai/faux").

source: Operator "%s" expects its value to be a list (array).
fr_fr: L'opérateur "%s" ne peut recevoir qu'une liste (array).

source: Operator "%s" expects its value to be a single list (1 dimension array).
fr_fr: L'opérateur "%s" ne peut recevoir qu'un tableau simple de type "clé/valeur", sans tableaux imbriqués.

source: Operator "%s" expects its value to be an array of 2 values exactly.
fr_fr: L'opérateur "%s" ne peut recevoir qu'un tableau de 2 valeurs (entières) exactement.

source: Operator "%s" expects its value to be a single value, not an array nor an object.
fr_fr: L'opérateur "%s" ne peut recevoir ni tableau, ni objet.

source: Operator "%s" expects its value to be a string, not an array nor an object.
fr_fr: L'opérateur "%s" ne peut recevoir qu'une valeur de type chaîne.

source: Operator IN_SELECT expects a query builder, instance of QueryBuildSelect.
fr_fr: L'opérateur IN_SELECT n'accepte que les objets d'instance QueryBuildSelect.

source: Unhandled join type "%s"
fr_fr: Type de jointure "%s" non supporté.

source: "ON" clause is mandatory
fr_fr: La clause "ON" est obligatoire

source: [Y-m-d H:i:s]
fr_fr: [d/m/Y H:i:s]

source: Global application settings file does not exist yet. You should setup your app first:
fr_fr: Le fichier de configuration globale de l'application n'existe pas encore. Vous devriez d'abord initialiser votre application :

source: Missing required parameter "%s" in collection passed as argument
fr_fr: Paramètre obligatoire "%s" manquant dans l'objet passé en argument

source: ERROR
fr_fr: ERREUR

source: Error
fr_fr: Erreur

source: error
fr_fr: erreur

source: Debugger
fr_fr: Débogueur

source: Close
fr_fr: Fermer

source: %1s in "%2s" at line %3s: %4s
fr_fr: %1s dans "%2s" à la ligne %3s : %4s

source: Error code %1s: %2s
fr_fr: Erreur code %1s : %2s

source: In %1s (%2s)
fr_fr: Dans %1s (%2s)

source: START
fr_fr: DÉBUT

source: is not a well formed PHP file.
fr_fr: n'est pas un fichier PHP correctement formé.

source: does not exist
fr_fr: n'existe pas

source: Please choose a class that extends a Controller
fr_fr: Veuillez choisir une classe qui étend d'un contrôleur

source: File and/or class not found
fr_fr: Fichier et/ou classe introuvables

source: Could not create folder: "%s" because parent folder does not exist yet. You should create it before.
fr_fr: Impossible de créer le répertoire "%s" car le dossier parent n'existe pas encore. Vous devriez créer ce dossier parent au préalable.

source: Folder: "%s" already exists
fr_fr: Répertoire "%s" déjà existant

source: Created folder: "%s"
fr_fr: Répertoire créé : "%s"

source: Could not create folder: "%s"
fr_fr: Impossible de créer le répertoire : "%s"

source: File "%s" already exists.
fr_fr: Le fichier "%s" existe déjà.

source: Overwrite file? [Yn]
fr_fr: Réécrire le fichier ? [OUI, non]

source: Folder "%s" does not exist yet.
fr_fr: Le répertoire "%s" n'existe pas encore.

source: Create folder? [Yn]
fr_fr: Créer le répertoire ? [OUI, non]

source: File "%s" successfully written
fr_fr: Fichier "%s" écrit avec succès

source: Unabled to create file "%s"
fr_fr: Impossible de créer le fichier "%s"

source: Unabled to start session
fr_fr: Une erreur est survenue lors du démarrage de la session

source: no
fr_fr: non

source: yes
fr_fr: oui

source: Your project "%s" does not contain a "project.json" configuration file.
fr_fr: Votre projet "%s" ne contient pas encore le fichier de configuration "project.json".

source: Using env '%s'
fr_fr: Sélection de l'environnement "%s"

source: Project "%s" does not exist!
fr_fr: Le projet "%s" n'existe pas !

source: Keeping project "%s".
fr_fr: On garde le projet "%s".

source: Missing required configuration file in your project!
fr_fr: Le fichier de configuration de votre projet est manquant et est obligatoire !

source: Create "project.json" file? [Yn]
fr_fr: Créer le fichier "project.json" ? [OUI, non]

source: This class is for CLI purpose only!
fr_fr: Ce service n'est utilisable qu'en mode CLI !

source: File "%s" not found. Using default template file.
fr_fr: Fichier "%s" introuvable. Utilisation de la template par défaut.

source: Layout file "%s" not found.
fr_fr: Fichier de gabarit de page HTML (layout) "%s" introuvable.

source: "Console" namespaces are not accessible in HTTP mode.
fr_fr: L'espace de nom "Console" et ses sous-espaces ne sont évidemment pas accessibles via requête HTTP.

source: PHP process time:
fr_fr: Temps total d'exécution PHP :

source: Allocated mem:
fr_fr: Mém. allouée :

source: MB
fr_fr: Mo

source: PHP version:
fr_fr: Version PHP:

source: You have fatal errors at low level application. Controller could not have been instantiated:
fr_fr: Vous avez des erreurs fatales à un niveau "bas" de l'application (niveau système ou noyau). Le contrôleur n'a sans doute pas pu être instancié :

source: FINISH
fr_fr: FIN

source: 404 Page not found
fr_fr: Erreur 404 Page introuvable

source: footer
fr_fr: Pied de page

source: Site in construction...
fr_fr: Site en construction...
