Repository: FragBis/FragTale2
Catalog: resources/locales/*/LC_MESSAGES/core.po
Languages: fr_fr

source: Entering folder "%s"
fr_fr: Dans le répertoire "%s"

source: Type folder in which to place your new controllers:
fr_fr: Tapez le répertoire dans lequel placer vos nouveaux contrôleurs (chemin relatif à partir de "Controller/Web") :

source: · "--project": the project name to create (in camel case and no special chars)
fr_fr: · "--project" : Le nom du projet à créer (casse sensible, en "camel case" et sans caractères spéciaux)

source: · "--host": if passed, it will automatically bind this project to a hostname
fr_fr: · "--host" : si explicité, cela va automatiquement associer le projet à cet hôte

source: Entering project creator
fr_fr: Espace création projet

source: Type your project name (in camel cases, no spaces, no special chars, no accents and not starting with a number)
fr_fr: Tapez le nom de votre projet (en "camel case", pas d'espace, pas de caractères spéciaux, pas d'accent, ne doit pas commencer par un chiffre)

source: Invalid namespace format.
fr_fr: Format de l'espace de nom invalide.

source: Creating project "%s"...
fr_fr: Création du projet "%s"...

source: When you create controllers, this will also create the corresponding view (unless you specify not to create the view with the controller).
fr_fr: Lorsque vous créerez des contrôleurs, cela créera également la vue correspondante (sauf si vous explicitez le fait de ne pas créer la vue associée).

source: The HTML format corresponds to a classic view of displaying a Web page (creation of a ".phtml" file with HTML and PHP tags).
fr_fr: Le format HTML correspond à une vue classique d'affichage d'une page Web (création d'un fichier ".phtml" avec balises HTML et PHP).

source: The HTML_NO_LAYOUT format corresponds to a view called in AJAX without the general "layout" (without the large <html> tag, without the <head> tag and therefore, without the JS and CSS sources which are not useful during a response AJAX).
fr_fr: Le format HTML_NO_LAYOUT correspond à une vue appelée en AJAX sans le "layout" général (sans la grande balise <html> , sans la balise <head> et donc, sans les sources JS et CSS qui ne sont pas utiles lors d'une réponse AJAX).

source: JSON and XML formats correspond to sending data and are useful for a REST API.
fr_fr: Les formats JSON et XML correspondent à un envoi de données et sont utiles pour une API REST.

source: Other formats should generally not be used as the default template. When in doubt, choose 1.
fr_fr: Les autres formats ne devraient pas généralement être utilisés comme template par défaut. Dans le doute, choisissez 1.

source: Choose your default template format:
fr_fr: Choisissez votre format de template par défaut :

source: Project folder already exists. Do you want to continue? [yN]
fr_fr: Le répertoire du projet existe déjà. Voulez-vous poursuivre ? [oui, NON]

source: Do you want to set project host? [yN]
fr_fr: Voulez-vous configurer le nom d'hôte (ou l'IP) du projet ? [oui, NON]

source: Working on %s
fr_fr: Travail sur "%s"

source: File "%s" already exists
fr_fr: Le fichier "%s" existe déjà

source: Created file: %s
fr_fr: Fichier créé : %s

source: Could not create file: %s
fr_fr: Échec de la création du fichier : %s

source: Model mapping for project "%s"
fr_fr: Mapping d'un modèle pour le projet "%s"

source: This controller automatically maps database tables to build all classes and entities that simply correspond to the relational database structure
fr_fr: Ce contrôleur "mappe" automatiquement les tables d'une base de données afin de générer toutes les classes d'entités correspondantes à la structure de cette base

source: You have not setup yet your database credentials. This is a pre-requisite.
fr_fr: Vous n'avez pas encore configuré les connecteurs de base de données. C'est un pré-requis.

source: Your database configurations does not contain any SQL type connector (mysql, psql...).
fr_fr: Votre configuration de base de données ne contient aucun connecteur SQL (MySQL ou Postgresql).

source: Choose connectorId in the list below
fr_fr: Choisissez le connecteur dans la liste suivante

source: Confirm model mapping "%1s" from database "%2s": [yN]
fr_fr: Confirmez le processus de mapping du modèle "%1s" de la base "%2s" : [oui, NON]

source: Process interrupted
fr_fr: Processus interrompu

source: OK, mapping database...
fr_fr: OK, mapping de la base...

source: Parameter "database" (name) is required in selected configuration. You have to set this value. Please check your configuration file and mention a dataabse name.
fr_fr: Le paramètre "database" (name) est requis dans la configuration sélectionnée. Vous devez saisir obligatoirement une valeur pour ce champ. Merci de vérifier votre fichier de configuration et renseignez le nom de la base de données si nécessaire.

source: No information retrieved
fr_fr: Aucune information trouvée

source: No columns found for table "%s"
fr_fr: Aucune colonne trouvée pour la table "%s"

source: Exporting table "%1s" structure into "%2s"
fr_fr: Extraction des informations structurelles de la table "%1s" dans "%2s"

source: Creating constant class containg colum names into "%s"
fr_fr: Création de la classe de constantes contenant les noms de colonnes dans "%s"

source: Creating model super abstract class "%s"
fr_fr: Création de la super classe abstraite "%s" qui étend de la classe "FragTale\Application\Model"

source: Please, select one of these models to remap it or leave empty to create new model:
fr_fr: Sélectionnez le modèle à remapper (tapez l'un des numéros) ou laissez vide et pressez "Entrée" pour en créer un nouveau :

source: Please, select one of these models:
fr_fr: Veuillez sélectionner l'un de ces modèles :

source: Type your new model name:
fr_fr: Saisissez le nom de votre nouveau modèle qui correspondra au nom d'espace des classes de ce modèle :

source: Failed to parse your model name. Special chars are not allowed.
fr_fr: Nom de modèle invalide. Veillez à ne pas saisir de caractères spéciaux.

source: Insert or update your custom dataset "%s"
fr_fr: Insérer ou mettre à jour un jeu de données (Dataset "%s") défini par le programme

source: This controller automatically upserts data into specified table defined from your model.
fr_fr: Ce contrôleur "upsert" (update or insert) automatiquement des données dans une table liée à une entité définie dans l'un de vos modèles.

source: An entity folder must contain a file prefixed by "D_" and containing specified data to import into the database.
fr_fr: Le répertoire d'une entité doit contenir un fichier préfixé par "D_", contenant une classe de type "Dataset". Les données contenues dans le tableau "$definition" sont des lignes à injecter dans la table correspondant à l'entité.

source: An array $definition must have been set into the "Dataset" class in the constructor. Definition is what this process import.
fr_fr: Un tableau $definition doit avoir été assigné dans dans la classe de type "Dataset" dans son constructeur. Cette définition est ce qui doit être importé en base.

source: Confirm dataset import from your project models into your database: [yN]
fr_fr: Confirmez l'importation des données depuis les modèles (dataset) de vos projets vers la ou les bases de données : [oui, NON]

source: Working on Dataset %s
fr_fr: Travail sur le Dataset "%s"

source: Result:
fr_fr: Résultat :

source: Class %s is not an instance of Dataset. It cannot be used to import definition.
fr_fr: La classe "%s" doit obligatoirement hériter de "FragTale\Application\Model\Dataset". Toute autre classe sera ignorée.

source: Upserting:
fr_fr: Upsert :

source: Missing required core folder:
fr_fr: Répertoire système manquant :

source: You should rebase your framework from the GIT source!
fr_fr: Vous devriez réinitialiser le "framework" à partir des sources GIT (rebase ou checkout) !

source: Created file:
fr_fr: Fichier créé :

source: Could not create file:
fr_fr: Impossible de créer le fichier :

source: You might not have write access on targetted folder.
fr_fr: Vous n'avez probablement pas les accès en écriture sur le répertoire concerné.

source: Missing versioned core file: %s
fr_fr: Fichier système manquant : %s

source: You have 3 sections:
fr_fr: 3 sections au choix :

source: · "CliApplication": Setup your CLI application global settings with 2 more sub sections: "Locale" (define your language) and "Parameter" (optional).
fr_fr: · "CliApplication" : Configurez cette application CLI suivant ces 2 sous-sections : "Locale" (définissez la langue de l'interface) et "Parameter" (optionnel, il s'agit de vos paramètres utilisateurs, placés globalement dans l'application)

source: · "Hosts": This part is important. It will allows you to route a host (domain or IP) to a specified existing project.
fr_fr: · "Hosts" : Cette section est importante à configurer ! Il vous faut absolument pointer à ce niveau vos domaines (ou IP) à vos projets, de manière globale.

source: · "Module": offers a list of modules to install.
fr_fr: · "Module": propose une liste de modules à installer.

source: Here, you can setup your CLI application with 2 sections:
fr_fr: Ici, vous pouvez configurer votre application Console selon les 2 sections ci-dessous :

source: · "Locale": choose one of the supported languages and define encoding being used by your system (usually, "UTF-8" or "utf8").
fr_fr: · "Locale" : choisissez parmi la liste de langues supportées (par exemple, fr_FR ou en_US). Il vous faut aussi définir l'encodage et habituellement, utilisez UTF-8 (ou "utf8", cela dépend du système d'exploitation).

source: To know your system locale, just type in console following command: locale
fr_fr: Pour connaître la "locale" de votre système, tapez simplement la commande suivante dans un terminal : locale

source: · "Parameter": you can setup custom parameters that you'll have to handle.
fr_fr: · "Parameter" : Configurez vos paramètres utilisateurs (il vous incombera de les exploiter dans votre code, ces paramètres sont récupérables depuis les classes de Service).

source: Here, the configuration file involved is "resources/configuration/application.json".
fr_fr: Ici, le fichier de configuration impliqué est "resources/configuration/application.json".

source: OK, check configuration file:
fr_fr: OK, vous pouvez vérifier le fichier de configuration :

source: No modification made
fr_fr: Aucune modification effectuée

source: Manage CLI application locale and encoding
fr_fr: Gestion de la locale et de l'encodage utilisés par l'application Console

source: Select locale from the list below:
fr_fr: Choisissez l'une des locales supportées dans la liste ci-dessous :

source: Encoding (%s preferable):
fr_fr: Encodage (%s préféré) :

source: Entering CLI application parameters setup
fr_fr: Espace de gestion des paramètres d'application Console

source: You can create your own custom parameters. It is up to you to use them in your project.
fr_fr: Vous pouvez créer vos propres paramètres. À vous de les utiliser dans votre projet.

source: Attention! Configuration will be saved only at the very end of the process.
fr_fr: Attention ! Le fichier de configuration n'est sauvegardé qu'à la toute fin du process.

source: Do not "Ctrl+C" (force quit) if you want to save file.
fr_fr: N'appuyez pas "Ctrl+C" (sortie forcée) si vous voulez sauvegardez vos modifications dans le fichier de configuration.

source: Setup parameters? [yN]
fr_fr: Configurer vos paramètres ? [oui, NON]

source: %d parameter(s) registered
fr_fr: Il y a %d paramètre(s) enregistré(s)

source: Leave empty and press Enter to create new parameter
fr_fr: Laissez vide et appuyez "Entrée" pour créer un nouveau paramètre. Sinon, choisissez l'un des paramètres ci-dessous

source: Enter new value for param "%s"
fr_fr: Entrez une nouvelle valeur pour le paramètre "%s"

source: This CLI application cannot handle modifications on parameters containing objects (only single values). Update JSON file manually.
fr_fr: Cette application CLI ne gère pas les paramètres autres que simples valeurs. Éditez manuellement le fichier de conf pour modifier les paramètres contenant des listes ou des objets.

source: Param "%1s" contains: %2s
fr_fr: Le paramètre "%1s" contient : %2s

source: Enter new parameter key:
fr_fr: Entrez la nouvelle clé :

source: Key "%s" already exists.
fr_fr: La clé "%s" existe déjà.

source: Enter new value for param "%s":
fr_fr: Entrez la nouvelle valeur pour le paramètre "%s" :

source: Key cannot be empty
fr_fr: La clé ne peut pas être vide, nulle ou 0

source: Setup another parameter? [yN]
fr_fr: Configurer un autre paramètre ? [oui, NON]

source: Here, you can setup your servers:
fr_fr: Ici, vous pouvez configurer vos serveurs :

source: · "%s": You can add a configuration file into "sites-available".
fr_fr: · "%s": Vous pouvez ajouter un fichier de configuration dans "sites-available".

source: · "Hosts": You can add a domain bound to 127.0.0.1 in your /etc/hosts file (only for Linux distributions).
fr_fr: · "Hosts": Vous pouvez ajouter un domaine associé à l'IP 127.0.0.1 dans votre fichier "/etc/hosts" (uniquement pour distributions Linux).

source: Invalid given PHP version "%s"
fr_fr: Version donnée de PHP invalide : "%s"

source: Basic virtual host configuration deployment.
fr_fr: Déploiement d'une configuration d'hôte de base.

source: Apache2 must have been installed with its PHP module for Apache, using PHP-FPM!
fr_fr: Apache2 doit déjà être installé avec son module PHP à la version adéquate et en utilisant PHP-FPM.

source: · "--root": absolute path of document root. If not passed, it will use the public folder of this application
fr_fr: · "--root" : chemin absolu pour "DocumentRoot". Si l'argument n'est pas passé, l'application utilisera le répertoire "public" de son emplacement actuel (vous pourriez dépoyer néanmoins une configuration pour un framework FragTale2 installé ailleurs).

source: · "--php-version": for example, "8.3". If not specified, it will use the PHP version of the current executed PHP binary.
fr_fr: · "--php-version" : par exemple, "8.3". Si non spécifiée explicitement, l'application prendra la version PHP utilisée pour exécuter cette commande.

source: · "--dest": destination folder where the apache configuration will be placed (default is "/etc/apache2/sites-available")
fr_fr: · "--dest" : répertoire de destination dans lequel le fichier de configuration sera copié (par défaut, c'est "/etc/apache2/sites-available")

source: Type Apache2 "sites-available" absolute path:
fr_fr: Tapez le chemin absolu du répertoire correspondant à "sites-available" d'Apache2 :

source: Destination folder "%s" does not exist or is not accessible.
fr_fr: Le répertoire de destination "%s" n'existe pas ou n'est pas accessible.

source: Type the server name (host):
fr_fr: Tapez le nom d'hôte :

source: Server name cannot be empty!
fr_fr: Le nom d'hôte ("server name") ne peut être vide !

source: File "%s" already exists and will not be overwritten.
fr_fr: Le fichier "%s" existe déjà et ne sera pas remplacé.

source: You are setting up "localhost" that should already have been configured by default. Check any configuration conflict.
fr_fr: Vous souhaitez configurer "localhost" qui doit certainement avoir déjà une configuration par défaut. Vérifiez que cela n'entre pas en conflit.

source: Type the server document root:
fr_fr: Tapez le chemin absolu du répertoire de base à exposer sur le Web (répertoire "public") :

source: Document root "%s" does not exist or is not accessible.
fr_fr: Le répertoire de base "%s" n'existe pas ou n'est pas accessible.

source: Type PHP version:
fr_fr: Tapez la version PHP :

source: Required file is missing: %s.
fr_fr: Fichier requis manquant : %s.

source: You must enable your new Apache host and restart your web server:
fr_fr: Vous devez rendre actif (placer dans "sites-enable") votre nouvel hôte Apache et redémarrer votre serveur Web :

source: · "--host": host name to append to /etc/hosts file
fr_fr: · "--host" : Le nom d'hôte à ajouter au fichier /etc/hosts

source: Accessing your "/etc/hosts" file in write mode (only for Linux distributions)...
fr_fr: Accès en écriture sur le fichier "/etc/hosts" (uniquement pour les distributions Linux)...

source: Modifying this file is only for local machines to use custom virtual hosts. Do not use it in production.
fr_fr: Modifier ce fichier n'est utile que pour "virtualiser" des noms de domaine sur votre machine locale. Ne pas utiliser en production.

source: This application appends new domain bound to 127.0.0.1 localhost
fr_fr: Cette application vous permet d'ajouter un nouveau domaine sur la ligne associée à l'IP 127.0.0.1 localhost

source: Backup your file before...
fr_fr: Faites une sauvegarde de votre fichier avant...

source: Here are your current hosts:
fr_fr: Ci-dessous, votre configuration actuelle :

source: Type a new custom domain to append: (Ctrl+C to exit)
fr_fr: Tapez un nouveau domaine à ajouter à la ligne : (Ctrl+C pour quitter)

source: Hostname is already registered! Nothing to do.
fr_fr: Le nom d'hôte est déjà enregistré ! Rien à faire de plus.

source: Your new file content:
fr_fr: Nouveau contenu du fichier :

source: Confirm registration [yN]
fr_fr: Confirmez l'enregistrement [oui, NON]

source: OK, file written.
fr_fr: OK, fichier réécrit.

source: Could not find line for 127.0.0.1
fr_fr: La ligne de configuration pour l'IP 127.0.0.1 n'a pu être trouvée

source: Nginx must have been installed with PHP-FPM!
fr_fr: Nginx doit déjà être installé avec la version choisie de PHP-FPM !

source: · "--dest": destination folder where the nginx configuration will be placed (default is "/etc/nginx/sites-available")
fr_fr: · "--dest" : répertoire de destination dans lequel le fichier de configuration sera copié (par défaut, c'est "/etc/nginx/sites-available")

source: Type Nginx "sites-available" absolute path:
fr_fr: Tapez le chemin absolu du répertoire correspondant à "sites-available" de Nginx :

source: Required file is missing: %s. Exiting.
fr_fr: Fichier requis manquant : %s. Fin de programme.

source: You must enable your new Nginx host and restart your web server. For example:
fr_fr: Vous devez rendre actif (placer dans "sites-enable") votre nouvel hôte Nginx et redémarrer votre serveur Web :

source: Here, you can bind one host (domain or IP) to one project.
fr_fr: Ici, vous pouvez associer un domaine (ou une IP) à un projet, de manière globale (pensez à associer également le domaine à un environnement de projet).

source: This is needed to route a host to a specific project.
fr_fr: Ceci est nécessaire afin de router un domaine vers un projet donné. C'est l'une des pièces maîtresses du système de routage de ce framework.

source: One project can handle multiple hosts.
fr_fr: Un projet peut gérer plusieurs domaines et donc, dans un projet, un environnement spécifique peut être associé aussi à un domaine donné. Par exemple, il faut pointer les domaines "monsite.fr" et "development.monsite.fr" au projet "MonSite" et dans la configuration du projet "MonSite", il faut définir que "monsite.fr" est associé à l'environnement "production" et "development.monsite.fr" est associé à l'environnement "development".

source: But, one host is bound to only one project.
fr_fr: Un projet peut avoir plusieurs domaines, cependant un domaine ne peut être associé qu'à UN SEUL projet ET UN SEUL environnement.

source: Entering hosts management
fr_fr: Configuration des associations "nom d'hôte / projet"

source: There is no project created yet. Please, create project fisrt by launching command: ./fragtale2 Console/Project/Create
fr_fr: Il n'y a encore aucun projet créé. Exécutez d'abord la commande : ./fragtale2 Console/Project/Create

source: Given project "%s" does not exist!
fr_fr: Le projet donné "%s" n'existe pas !

source: Selected project "%1s" bound to host "%2s"
fr_fr: Le projet sélectionné "%1s" est désormais associé à l'hôte "%2s"

source: Please select project to bind to:
fr_fr: Sélectionnez le projet à associer :

source: (add new)
fr_fr: (ajouter)

source: Below is the list of existing configured hosts.
fr_fr: Ci-dessous, la liste des domaines déjà enregistrés et liés à un projet.

source: If you select "1", you'll create new domain to bind to an existing project.
fr_fr: Taper "1" vous permettra d'enregistrer un nouveau domaine et l'associer à un projet existant.

source: Other choice allows you to modify or delete a host and project binding.
fr_fr: Les autres numéros correspondent à des domaines déjà associés que vous pourrez soit modifier, soit supprimer.

source: host --> project
fr_fr: Choisir une association "domaine --> projet" ou taper "1" pour créer une nouvelle entrée :

source: Choose action
fr_fr: Choisissez l'une de ces actions

source: Update
fr_fr: Modifier

source: Delete
fr_fr: Supprimer

source: Confirm deletion
fr_fr: Confirmez la suppression

source: Host configuration file is empty.
fr_fr: Le fichier de configuration "hosts.json" est vide.

source: Please, type a domain name or an IP to bind to an existing project.
fr_fr: Tapez un nom de domaine ou une IP à associer à un projet existant.

source: OK, hosts file modified
fr_fr: OK, fichier "resources/configuration/hosts.json" modifié

source: Entering modules management
fr_fr: Configuration des modules

source: Here, you can install new module between the list below
fr_fr: Ici, vous pouvez installer un nouveau module dans la liste suivante (il s'agit de modules complémentaires, natifs à ce framework)

source: (installed)
fr_fr: (installé)

source: Please, type the module name you want to install
fr_fr: Veuillez taper le nom exact du module que vous souhaitez installer

source: Unknown module "%s"
fr_fr: Module "%s" inconnu

source: Unknown function
fr_fr: Fonction inconnue

source: Not Found
fr_fr: Introuvable

source: Missing required file "%s". You should remap your database model.
fr_fr: Fichier "%s" manquant. Vous devriez "remapper" votre modèle de base de données.

source: Key to match must be a property of the entity used.
fr_fr: La clé à comparer doit être une propriété de l'entité utilisée.

source: Row of InitialData does not contain one of keys to match passed as argument.
fr_fr: Un des éléments dans "InitialData" ne contient pas au moins l'une des clés à vérifier passés en argument.

source: NewData passed must contain rows typed as DataCollection and each row must contain key/value corresponding to the keys 2 match.
fr_fr: Le paramètre passé "NewData" doit contenir des DataCollections et chacune d'elles doit contenir les clés à comparer.

source: Row of NewData does not contain one of keys to match passed as argument.
fr_fr: Un des éléments dans "NewData" ne contient pas au moins l'une des clés à vérifier passés en argument.

source: Field "%s" must be an integer.
fr_fr: Le champ "%s" doit être un entier numérique.

source: Field "%s" must be numeric.
fr_fr: Le champ "%s" doit être un nombre.

source: Field "%1s" must be an integer corresponding to a time in seconds or a string having format like "00:00:00". Given: "%2s"
fr_fr: Le champ "%s" doit être un entier correspondant à un temps en secondes ou une chaîne au format "00:00:00". Donné : "%2s"

source: Date "%1s" for column "%2s" is invalid.
fr_fr: La date "%1s" pour le champ "%2s" est invalide.

source: Field "%s" must be a boolean (true/false).
fr_fr: Le champ "%s" doit être un booléen ("vrai/faux").

source: Value for field "%1s" must be a scalar. Given: "%2s"
fr_fr: La valeur pour le champ "%s" doit une être une valeur simple (ni tableau, ni objet). Valeur donnée : "%2s"

source: Field "%1s" must be a decimal number having maximum %2s digit before dot.
fr_fr: Le champ "%1s" doit être une décimale dont le nombre avant la virgule ne doit pas avoir plus de %2s chiffre(s).
